{"translation-revision-date":"2024-06-14 13:33:55+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n > 1;","lang":"tr"},"Please try the %1$sDirect Conversion%2$s method if you don’t have server access, or %3$scontact support%4$s for further assistance.":["Sunucu erişiminiz yoksa lütfen %1$sDirekt Çevirme%2$s yöntemini deneyin veya daha fazla yardım için %3$sdestekle iletişime geçin%4$s."],"Activate the Local WebP feature with a single click; no server configuration required.":["Yerel WebP özelliğini tek bir tıklamayla etkinleştirin; sunucu yapılandırması gerekmez."],"Fix the \"Serve images in next-gen format\" Google PageSpeed recommendation with a single click! Serve WebP images directly from your server to supported browsers, while seamlessly switching to original images for those without WebP support. All without relying on a CDN or any server configuration.":["“Görüntüleri yeni nesil formatta sunun” Google PageSpeed önerisini tek bir tıklamayla düzeltin! WebP görüntülerini doğrudan sunucunuzdan desteklenen tarayıcılara sunarken, WebP desteği olmayanlar için sorunsuz bir şekilde orijinal görüntülere geçin. Hem de bir CDN’e veya herhangi bir sunucu yapılandırmasına ihtiyaç duymadan."],"UNLOCK WEBP WITH PRO":["PRO İLE WEBP KİLİDİNİ AÇIN"],"This stage is already completed.":["Bu aşama halihazırda tamamlanmıştır."],"Setup":["Kurulum"],"Finishing setup…":["Ayarlama bitiriliyor…"],"Check status":["Durumu Kontrol Et"],"Quit":["Çık"],"Quit setup":["Kurulumdan çık"],"Something went wrong with the request.":["Taleple ilgili bir şeyler ters gitti."],"Step %s":["Adım %s"],"Convert now":["Şimdi dönüştür"],"Convert Images to WebP":["Görüntüleri WebP'ye Dönüştürme"],"Next, click Check Status button below to see if it's working.":["Ardından, çalışıp çalışmadığını görmek için aşağıdaki Durumu Kontrol Et düğmesine tıklayın."],"Get Support.":["Destek Al."],"Still having trouble?":["Hala sorun mu yaşıyorsunuz?"],"NGINX":["NGINX"],"Apache":["Apache"],"WebP conversion is active and working well. Your hosting has automatically pre-configured the conversion for you. The only step for you would be to create WebP images below.":["WebP dönüştürme aktif ve iyi çalışıyor. Hostinginiz dönüşümü sizin için otomatik olarak önceden yapılandırmıştır. Sizin için tek adım aşağıdaki WebP görüntülerini oluşturmak olacaktır."],"Since your site is hosted with WPMU DEV, we already have done the configurations steps for you. The only step for you would be to create WebP images below.":["Siteniz WPMU DEV ile barındırıldığından, yapılandırma adımlarını sizin için zaten yaptık. Sizin için tek adım aşağıdaki WebP görsellerini oluşturmak olacaktır."],"We noticed the Amazon S3 Integration is enabled. Offloaded images will not be served in WebP format, but Smush will create local WebP copies of all images. If this is undesirable, you can quit the setup.":["Amazon S3 Entegrasyonunun etkin olduğunu fark ettik. Boşaltılan görüntüler WebP formatında sunulmayacak, ancak Smush tüm görüntülerin yerel WebP kopyalarını oluşturacaktır. Bu istenmiyorsa, kurulumdan çıkabilirsiniz."],"The rules have been applied successfully.":["Kurallar başarıyla uygulanmıştır."],"Finish Setup":["Kurulumu Tamamla"],"The following configurations are for NGINX servers. If you do not have access to your NGINX config files you will need to contact your hosting provider to make these changes.":["Aşağıdaki yapılandırmalar NGINX sunucuları içindir. NGINX yapılandırma dosyalarınıza erişiminiz yoksa, bu değişiklikleri yapmak için barındırma sağlayıcınızla iletişime geçmeniz gerekecektir."],"Add Rules":["Kural Ekleme"],"Choose Server Type":["Sunucu Türünü Seçin"],"Serve WebP version of images in the browsers that support it and fall back to JPEGs and PNGs for unsupported browsers.":["Destekleyen tarayıcılarda görüntülerin WebP sürümünü sunun ve desteklenmeyen tarayıcılar için JPEG'lere ve PNG'lere geri dönün."],"Fix “Serve images in next-gen format\" Google PageSpeed recommendation.":["\"Görselleri yeni nesil formatta sun\" Google PageSpeed önerisini düzeltin."],"Manual":["Manuel"],"Automatic":["Otomatik"],"Copy the generated code below and paste it at the top of your .htaccess file (before any existing code) in the root directory.":["Aşağıda oluşturulan kodu kopyalayın ve kök dizindeki .htaccess dosyanızın en üstüne (mevcut kodlardan önce) yapıştırın."],"If you are unable to get the automated method working, follow these steps:":["Otomatik yöntemin çalışmasını sağlayamıyorsanız, aşağıdaki adımları izleyin:"],"Local WebP":["Yerel WebP"],"Smush WebP":["Smush WebP"],"Reload NGINX.":["NGINX'i yeniden yükle."],"Copy the generated code found below and paste it inside your http or server blocks.":["Aşağıda bulunan oluşturulan kodu kopyalayın ve http ya da sunucu bloğunuzun içine yapıştırın."],"Insert the following in the server context of your configuration file (usually found in \/etc\/nginx\/sites-available). “The server context” refers to the part of the configuration that starts with “server {” and ends with the matching “}”.":["Aşağıdakileri yapılandırma dosyanızın sunucu ayar içeriğine ekleyin (genellikle \/etc\/nginx\/sites-available içinde bulunur). \"Sunucu ayar içeriği\", yapılandırmanın \"server {\" ile başlayan ve \"}\" ile biten kısmını ifade eder."],"If you don't know where those files are, or you aren't able to reload Apache, you would need to consult with your hosting provider or a system administrator who has access to change the configuration of your server.":["Bu dosyaların nerede olduğunu bilmiyorsanız veya Apache'yi yeniden yükleyemiyorsanız, hosting sağlayıcınıza veya sunucunuzun yapılandırmasını değiştirmek için erişimi olan bir sistem yöneticisine danışmanız gerekir."],"Reload Apache.":["Apache'yi yeniden yükle."],"Look for your site in the file and find the line that starts with <Directory> - add the code above that line and into that section and save the file.":["Dosyada sitenizi bulun ve <Directory> ile başlayan satırı bulun - kodu bu satırın üstüne ve o bölüme ekleyin ve dosyayı kaydedin."],"If .htaccess does not work, and you have access to vhosts.conf or httpd.conf, try this:":["Eğer .htaccess çalışmazsa ve vhosts.conf veya httpd.conf dosyalarına erişiminiz varsa, şunu deneyin:"],"Troubleshooting":["Sorun giderme"],"Apply rules":["Kuralları uygula"],"Please note: Some servers have both Apache and NGINX software which may not begin serving WebP images after applying the .htaccess rules. If errors occur after applying the rules, we recommend adding NGINX rules manually.":["Lütfen unutmayın: Bazı sunucular hem Apache hem de NGINX yazılımına sahiptir ve bu yazılım .htaccess kuralları uygulandıktan sonra WebP görüntülerini sunmaya başlamayabilir. Kuralları uyguladıktan sonra hatalar oluşursa, NGINX kurallarını manuel olarak eklemenizi öneririz."],"Smush can automatically apply WebP conversion rules for Apache servers by writing to your .htaccess file. Alternatively, switch to Manual to apply these rules yourself.":["Smush, .htaccess dosyanızı yazarak Apache sunucuları için WebP dönüştürme kurallarını otomatik olarak uygulayabilir. Alternatif olarak, bu kuralları kendiniz uygulamak için Manuel'e geçin."],"We've automatically detected your server type is %s. If this is incorrect, manually select your server type to generate the relevant rules and instructions.":["Sunucu türünüzün %s olduğunu otomatik olarak tespit ettik. Bu yanlışsa, ilgili kuralları ve talimatları oluşturmak için sunucu türünüzü manuel olarak seçin."],"Choose your server type. If you don’t know this, please contact your hosting provider.":["Sunucu tipinizi seçin. Bunu bilmiyorsanız, lütfen hosting sağlayıcınızla iletişime geçin."],"Server Type":["Sunucu tipi"],"Previous":["Önceki"],"Finish":["Bitir"],"Next":["Sonraki"],"Pro":["Pro"]}},"comment":{"reference":"app\/assets\/js\/smush-react-webp.js"}}